Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура Расш_гкс_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьНовыеЭлементы();
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		ЭтотОбъект["гкс_Организация"] = Параметры.Организация;
		ЭтотОбъект["гкс_Подразделение"] = Параметры.Подразделение;		
		ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"] = Истина;
		УстановитьОтборыСпискаНаСервере();			
	КонецЕсли;
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.
	торо_ЛокализацияМодификацияФорм.ПеревестиДинамическийСписок(ЭтаФорма, Список, "Наименование,Комментарий", Метаданные.Справочники.торо_ОбъектыРемонта);
	дс_УстановитьЗаголовкиЭлементов();
КонецПроцедуры

// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
&НаКлиенте
Процедура гкс_ОтборПоОрганизацииИПодразделению(Элемент)
	
	//ОтборВключен = ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"];
	//
	//Если ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"] Тогда 
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//		Список, "Организация", ЭтотОбъект["гкс_Организация"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	//		Список, "Подразделение", ЭтотОбъект["гкс_Подразделение"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);		
	//КонецЕсли;	
	УстановитьОтборыСпискаНаСервере();			
	
КонецПроцедуры // } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	МассивРеквизитов = Новый Массив();
	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИспользоватьОтборТипОбъекта",Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтборТипОбъектаУсловиеРавно",Новый ОписаниеТипов("Булево")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтборТипОбъекта",Новый ОписаниеТипов("ПеречислениеСсылка.торо_ТипыОбъектовRCM")));
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ОтборПоОрганизацииИПодразделению", Новый ОписаниеТипов("Булево")
			,,НСтр("ru='Отбор по организации и подразделению'")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")));
		МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия")));
	КонецЕсли;	
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.
	ИзменитьРеквизиты(МассивРеквизитов);
	//
	ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"] = Истина;
	Если Параметры.Свойство("ИспользоватьОтборТипОбъекта") И Параметры.ИспользоватьОтборТипОбъекта = Истина Тогда 
		ЭтотОбъект["ОтборТипОбъекта"] = ?(ЗначениеЗаполнено(Параметры.ОтборТипОбъекта),Параметры.ОтборТипОбъекта,Перечисления.торо_ТипыОбъектовRCM.Объект);
		ЭтотОбъект["ИспользоватьОтборТипОбъекта"] = Параметры.ИспользоватьОтборТипОбъекта;
	КонецЕсли;
	Если Параметры.Свойство("ОтборТипОбъектаУсловиеРавно") Тогда 
		ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"] = Параметры.ОтборТипОбъектаУсловиеРавно;
	КонецЕсли;
	
	// гкс+ [8220] Тарасов 19.10.2020
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "Код КАК Код", 
																"Код КАК Код,
																|	торо_ОбъектыРемонта.гкс_КатегорияРиска КАК гкс_ПриоритетОР");
	
	НЭлем = Элементы.Вставить("гкс_ПриоритетОР", Тип("ПолеФормы"), Элементы.Список, Элементы.Код);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Список.гкс_ПриоритетОР";
	// гкс+ [] Деснол 16.08.2022
	НЭлем.Заголовок = НСтр("ru='Категория риска';
	// гкс- [] Деснол 16.08.2022
							|en='Repair object priority';
							|es='Prioridad de objeto de reparación'");
	
	гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список);
	// гкс- [8220] Тарасов 19.10.2020
	
	// Гкс+[TOIR20-563] Зозуля А.В. от 01.04.2025. Добавлено:{
	Если Параметры.Свойство("Организация") И Параметры.Свойство("Подразделение") Тогда
		НЭлем = Элементы.Вставить("гкс_ОтборПоОрганизацииИПодразделению", Тип("ПолеФормы"));
		НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
		НЭлем.ВидФлажка = ВидФлажка.Выключатель;
		НЭлем.ПутьКДанным = "гкс_ОтборПоОрганизацииИПодразделению";
		//НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет; 
		НЭлем.УстановитьДействие("ПриИзменении", "гкс_ОтборПоОрганизацииИПодразделению");
		
	КонецЕсли;
	// } Гкс-[TOIR20-563] Зозуля А.В. от 01.04.2025.

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтобратьПоТипуОбъета(МассивОР, ОтборТип, СравнениеРавно = Истина)
	МассивВозврата = Новый Массив();
	МассивТолькоОР = Новый Массив();
	Для Каждого СтрокаМассива Из МассивОР Цикл
		Если типЗнч(СтрокаМассива.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
			МассивТолькоОР.Добавить(СтрокаМассива.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка В(&Ссылка)
		|	И "+?(СравнениеРавно=Ложь," Не ","")+" торо_ОбъектыРемонта.ТипОбъекта В (&ТипОбъекта)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивТолькоОР);
	МассивОтборТип = Новый Массив();
	МассивОтборТип.Добавить(ОтборТип);
	Если ОтборТип = Перечисления.торо_ТипыОбъектовRCM.Объект Тогда 
		МассивОтборТип.Добавить(Перечисления.торо_ТипыОбъектовRCM.ПустаяСсылка());
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипОбъекта", МассивОтборТип);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивВозврата;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	СтрПоиска = Новый Структура("Ссылка");
	Для Каждого СтрокаМассива Из МассивОР Цикл
		СтрПоиска.Ссылка = СтрокаМассива.Ссылка;
		Если типЗнч(СтрокаМассива.Ссылка) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
			Если Выборка.НайтиСледующий(СтрПоиска) Тогда 
				МассивВозврата.Добавить(СтрокаМассива);
			КонецЕсли;
			Выборка.Сбросить();
		КонецЕсли;
	КонецЦикла;

	Возврат МассивВозврата;
КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ВыборЗначения")
Процедура Расш_гкс_ВыборЗначения()

	УчтываетсяИерархияЭлементов = ИспользоватьВариантУчетаИерархииЭлементов И ЗначениеЗаполнено(ВариантУчетаИерархииЭлементов)
	И ВариантУчетаИерархииЭлементов <> ПредопределенноеЗначение("Перечисление.торо_ВариантыУчетаИерархииЭлементовПриПодборе.НеУчитыватьИерархию");

	РазрешитьВыборНеОР = (Параметры.КлючНазначенияИспользования = "ДобавлениеВИерархию");
	МассивВыбранныхСтрок = торо_РаботаСИерархией20Клиент.ПолучитьМассивДанныхВыделенныхСтрок(ЭтаФорма,,РазрешитьВыборКорняИерархии,РазрешитьВыборНеОР ИЛИ УчтываетсяИерархияЭлементов);

	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РазрешитьВыборГрупп = (Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Группы
	ИЛИ Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы);

	Если УчтываетсяИерархияЭлементов Тогда

		МассивВыбранныхСтрок = торо_РаботаСИерархией20.ДополнитьОтобратьМассивВыбранныхСтрок(МассивВыбранныхСтрок, ВариантУчетаИерархииЭлементов, ТекСтруктураИерархии, РазрешитьВыборГрупп);
	КонецЕсли;

	#Вставка
	Если ЭтотОбъект["ИспользоватьОтборТипОбъекта"] Тогда 
		МассивВыбранныхСтрок = ОтобратьПоТипуОбъета(МассивВыбранныхСтрок, ЭтотОбъект["ОтборТипОбъекта"],ЭтотОбъект["ОтборТипОбъектаУсловиеРавно"]);
		Если МассивВыбранныхСтрок.Количество() = 0 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Выбранные объекты не подходят по типу";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки

	НаличиеДанныхПомеченныхНаУдаление = Ложь;

	Для Каждого ДанныеСтр Из МассивВыбранныхСтрок Цикл

		Если торо_РаботаСИерархией20КлиентСервер.ЭтоОбычнаяГруппаПоКартинке(ДанныеСтр.ИндексКартинки) И НЕ РазрешитьВыборГрупп Тогда
			ТекстСообщения = НСтр("es='¡No es posible escoger el grupo!';ru='Нельзя выбрать группу!';en='Can not choose a group!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли типЗнч(ДанныеСтр.Ссылка) = Тип("СправочникСсылка.торо_СтруктурыОР") Тогда
			Если РазрешитьВыборКорняИерархии Тогда
				ЭтаФорма.ЗакрыватьПриВыборе = Истина;
				ОповеститьОВыборе(ПустойРодитель);
				Возврат;
			Иначе
				ТекстСообщения = НСтр("es='¡No es posible escoger la raíz!';ru='Нельзя выбирать корень!';en='Can not choose a root!'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
		ИначеЕсли ДанныеСтр.ПометкаУдаления = Истина Тогда
			НаличиеДанныхПомеченныхНаУдаление = Истина;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	ДопПараметры = Новый Структура("МассивВыбранныхСтрок", МассивВыбранныхСтрок);

	Если НаличиеДанныхПомеченныхНаУдаление Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияПослеПроверкиПометкиУдаления", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = НСтр("es='Los datos escogidos son marcados a la desaparición. "
		"¿Cumplir la elección de estos datos?';ru='Выбранные данные помечены на удаление."
		"Выполнить выбор этих данных?';en='The selected data is marked for deletion."
		"Select this data?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	Иначе

		ВыборЗначенияПослеПроверкиПометкиУдаления(КодВозвратаДиалога.Да, ДопПараметры);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура дс_УстановитьЗаголовкиЭлементов()
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("СтатусВУчете", НСтр("es='El estado de la contabilidad';
	|ru='Статус в учете';en='Status in accounting'"));

	Для каждого ЗаголовокЭлемента Из Заголовки Цикл
		ИмяЭлемента = ЗаголовокЭлемента.Ключ;
		ПереводЗаголовка = ЗаголовокЭлемента.Значение;
		
		Элементы[ИмяЭлемента].Заголовок = ПереводЗаголовка;
	КонецЦикла; 
КонецПроцедуры

// гкс+ [8220] Тарасов 19.10.2020
&НаСервереБезКонтекста
Процедура гкс_УстановитьУсловноеОформлениеНаПриоритетОР(Список)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_КатегорииРиска.Ссылка КАК КатегорииРиска,
	|	торо_КатегорииРиска.Представление КАК Представление,
	|	торо_КатегорииРиска.Цвет КАК Цвет
	|ИЗ
	|	Справочник.торо_КатегорииРиска КАК торо_КатегорииРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = ""+Выборка.Представление;
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР"); 
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение = Выборка.КатегорииРиска;
		
		ЦветФона = Выборка.Цвет.Получить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("гкс_ПриоритетОР");
		
	КонецЦикла;
	
КонецПроцедуры// гкс- [8220] Тарасов 19.10.2020

&НаСервере
Процедура УстановитьОтборыСпискаНаСервере()
	
	ОтборВключен = ЭтотОбъект["гкс_ОтборПоОрганизацииИПодразделению"];
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Организация", ЭтотОбъект["гкс_Организация"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Подразделение", ЭтотОбъект["гкс_Подразделение"], ВидСравненияКомпоновкиДанных.Равно, , ОтборВключен);
			
КонецПроцедуры	

#КонецОбласти
